Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitSegment
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitSegment class represents the tolerated Tekla.Structures.Geometry3d.LineSegment.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitSegment.#ctor(Tekla.Common.Geometry.Segment3,Tekla.Common.Geometry.Vector3)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitSegment class.
target: The target.
hitPoint: The hit point.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitSegment.#ctor(Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedLine)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitSegment class.
toleratedLine: The tolerated line.